// types
import { IRowId, IRowValues } from "../../types/common";
// utils
import { addValuesToObject } from "../../utils/store";
import { tableRowsAdapter } from "../../utils/table";

export const companies = [
  {
    name: "ООО Космос",
    workers: [
      {
        surname: "Федоров",
        name: "Дмитрий",
        post: "Программист",
      },
      { surname: "Шетько", name: "Светлана", post: "Менеджер" },
    ],
    adress: `г. Москва, Улица Академика Королева д. 12`,
  },
  {
    name: "ООО Сатурн",
    workers: [
      {
        surname: "Светлов",
        name: "Павел",
        post: "Программист",
      },
      {
        surname: "Савельев",
        name: "Петр",
        post: "Программист",
      },
      { surname: "Тарасова", name: "Мария", post: "Менеджер" },
    ],
    adress: `г. Москва, Улица Вавиловых д. 17`,
  },
  {
    name: "ООО Юпитер",
    workers: [
      {
        surname: "Златоус",
        name: "Аркадий",
        post: "продавец",
      },
      { surname: "Пивова", name: "Ирина", post: "Менеджер" },
    ],
    adress: `г. Москва, Улица Крыленко д.24`,
  },
  {
    name: "ОАО  Факел",
    workers: [
      {
        surname: "Петров",
        name: "Антон",
        post: "Генеральный директор",
      },
      { surname: "Разумнов", name: "Михаил", post: "Маркетолог" },
    ],
    adress: `г. Санкт-Петербург, ул. Миллионная д.1`,
  },
  {
    name: "ЗАО ИнтерРос",
    workers: [
      {
        surname: "Полякова",
        name: "Светлана",
        post: "Генеральный директор",
      },
      { surname: "Колбасова ", name: "Ирина", post: "Бухгалтер" },
    ],
    adress: `г. Санкт-Петербург, ул. Наличная д.15`,
  },
  {
    name: "ИП Лазарев Аркадий Петрович",
    workers: [],
    adress: `г. Санкт-Петербург, ул. Заречная д.23 офис 32`,
  },
  {
    name: "ООО Строймастер",
    workers: [
      {
        surname: "Петров",
        name: "Николай",
        post: "Генеральный директор",
      },
      { surname: "Манько", name: "Кирилл", post: "Таргетолог" },
    ],
    adress: `г. Санкт-Петербург, ул. Композиторов д.67`,
  },
  {
    name: "ИП Салов Николай Борисович",
    workers: [],
    adress: `г. Санкт-Петербург, ул. Федора Абрамова д.43 офис 309`,
  },
  {
    name: "ИП Новожилов Петр Иванович",
    workers: [],
    adress: `г. Санкт-Петербург, ул. Николая Рубцова д.23 офис 20`,
  },
  {
    name: "ООО Реал Снаб",
    workers: [
      { surname: "Яночко", name: "Денис", post: "Управляющий" },
      { surname: "Сидоров", name: "Дмитрий", post: "Прораб" },
      { surname: "Кочеров", name: "Сергей", post: "Рабочий" },
    ],
    adress: `Ленинградская обл., г. Выборг, ул. Казачья д.1`,
  },
  {
    name: "ООО ЛенОблСтрой",
    workers: [
      { surname: "Юманов", name: "Виктор", post: "Управляющий" },
      { surname: "Буланов", name: "Дмитрий", post: "Прораб" },
      { surname: "Кочеров", name: "Дмитрий", post: "Рабочий" },
    ],
    adress: `Ленинградская обл., г. Гатчина, ул. Ленина д.51`,
  },
  {
    name: "ООО Реал Снаб",
    workers: [
      { surname: "Астафьев", name: "Алексей", post: "Управляющий" },
      { surname: "Орловский", name: "Лев", post: "Прораб" },
      { surname: "Попович", name: "Юрий", post: "Рабочий" },
    ],
    adress: `Ленинградская обл., г. Кириши, ул. Октябрьских событий д.95`,
  },
  {
    name: "ООО Сено",
    workers: [
      { surname: "Ломтев", name: "Владимир", post: "Управляющий" },
      { surname: "Геннадий", name: "Катаев", post: "Прораб" },
      { surname: "Лукьянов", name: "Дмитрий", post: "Рабочий" },
    ],
    adress: `Ленинградская обл., г. Кингисепп, ул. Казачья д.1`,
  },
  {
    name: "ИП Прокоьев Аркадий Андреевич",
    workers: [],
    adress: `Ленинградская обл., г. Каменогорск, ул. Свердлова д.22`,
  },
  {
    name: "ИП Семенов Геннадий Андреевич",
    workers: [],
    adress: `Ленинградская обл., г. Выборг, ул. Степанова д.168`,
  },
  {
    name: "ИП Кучук Александр Александрович",
    workers: [],
    adress: `Ленинградская обл., г. Выборг, ул. Спортивная д.10`,
  },
  {
    name: "ИП Тихонович Дмитрий Сергеевич",
    workers: [],
    adress: `Ленинградская обл., г. Выборг, ул. Спортивная д.10`,
  },
];

export const mokData: Array<IRowId & IRowValues> = tableRowsAdapter(
  addValuesToObject(companies)
);
